cask_args appdir: '/Applications'

tap "aws/tap"
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/formula-analytics"
tap "homebrew/services"

# Search tool like grep, but optimized for programmers
brew "ack"

# Clone of cat with syntax highlighting and Git integration
brew "bat"

# Distributed revision control system
brew "git"

# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# Good-lookin' diffs with diff-highlight and more
brew "git-delta"

# In-depth comparison of files, archives, and directories
brew "diffoscope"

# Load/unload environment variables based on $PWD
brew "direnv"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"

# GitHub command-line tool
brew "gh"

# Emoji for git commits; gitmoji -i or gitmoji -c
brew "gitmoji"

# Inspiration...
brew "fortune"

# Because rainbows! For a rainbow cookie try fortune | lolcat
brew "lolcat"

# GNU Pretty Good Privacy (PGP)
brew 'gpg2'
brew 'gnupg'
brew 'pinentry-mac'

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Colorize logfiles and command output
brew "grc"

# Improved top (interactive process viewer)
brew "htop"

# Command-line benchmarking tool
brew "hyperfine"

# Making APIs simple from the command line
brew "httpie"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Command line JSON viewer
brew "fx"

# Mac App Store command-line interface
brew "mas"

# AWS SAM CLI
brew "aws-sam-cli"

# Simple tool to make locally trusted development certificates
brew "mkcert"

# Open source relational database management system
# TODO - update mysql

# Node version management
brew "n"

# Netlify
brew "netlify-cli"

# Terminal multiplexer
brew "tmux"

# Process manager for Procfile-based applications and tmux
brew "overmind"

# Display the PID number for a given process name
brew "pidof"

# Protocol buffers (Google's data interchange format)
brew "protobuf"

# Fast package manager
brew "pnpm"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Ruby version manager written in rust that is fast and handles installing ruby itself
brew "frum"

# Easy configuration of the browsers to use
brew "defaultbrowser"
brew "choosy"

# Internet file retriever
brew "wget"

# Fixing command line typos!
brew "thefuck"

# Community driven man pages
brew "tldr"

# MySQL UI
cask "sequel-pro"

# Password manager that keeps all passwords secure behind one password
cask "1password"

# Command-line helper for the 1Password password manager
cask "1password-cli"

# App to build and share containerized applications and microservices
cask "docker"

# git client (GitHub Desktop)
cask "github"

# Awesome terminal emulator
cask "iterm2"

# HTTP client that helps testing and describing APIs
cask "paw"

# GraphQL client
cask "altair-graphql-client"
cask "graphiql"

# HTTP and GraphQL Client
cask "insomnia"

# Host based application firewall
cask "little-snitch"

# Tool to remove unnecessary files and folders, and cleanly uninstall applications
cask "cleanmymac"

# VPN client for secure internet access and private browsing
cask "nordvpn"

# Web browser
cask "google-chrome"
cask "firefox"

# Nerd fonts with glyphs (in addition to Powerline)
cask "font-hack-nerd-font"

# Silence embarrassing notifications while screensharing
cask "muzzle"

# Menu bar organiser
cask "bartender"

# Emoji picker
cask "rocket"

# Open-source code editor
cask "visual-studio-code"

# Fast and extensible launcher
cask "raycast"

# Video communication and virtual meeting platform
cask "zoom"

# How I run my life
cask "todoist"
cask "notion-calendar"

# Communication and collaboration. And memes. And emoji!
cask "slack"

# Communication
cask "signal"
cask "chatmate-for-whatsapp"
cask "telegram"
cask "whatsapp"
cask "discord"

# Utilities
cask "elgato-stream-deck"

# Brain
cask "obsidian"

# Screenshots
cask "cleanshot"

# Backups
cask "chronosync"
cask "idrive"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Buffer", id: 1474298973
mas "Cardhop", id: 1290358394
mas "Cyberduck", id: 409222199
mas "Dato", id: 1470584107
mas "Fantastical", id: 975937182
mas "Foodnoms", id: 1479461686
mas "Hue Menu Bar", id: 1500678169
mas "iMazing Converter", id: 1292198261
# mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
# mas "Mactracker", id: 430255202
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "Petrify", id: 1451177988
mas "Pixelmator Pro", id: 1289583905
mas "RunCat", id: 1429033973
# mas "SmugMug", id: 1115348888
mas "StopTheMadness Pro", id: 6471380298
mas "TextSniper", id: 1528890965
mas "Times", id: 1048770312
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835

# Install manually...
# Elgato Apps (e.g. StreamDeck) - https://www.elgato.com/en/downloads
